# **`Lab3 - Data Engineering & EDA with Python, SQL, and Pandas`**

##### **Name** - Manu Mathew
##### **CourseID** - PROG8245
##### **Course** - Machine Learning Programming
##### **Student ID** - 8990691

---

**Install required packages**

In [135]:
%pip install psycopg2-binary pandas faker sqlalchemy scikit-learn

Requirement already satisfied: psycopg2-binary in ./.venv/lib/python3.13/site-packages (2.9.10)
Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: faker in ./.venv/lib/python3.13/site-packages (37.3.0)
Requirement already satisfied: sqlalchemy in ./.venv/lib/python3.13/site-packages (2.0.41)
Requirement already satisfied: scikit-learn in ./.venv/lib/python3.13/site-packages (1.6.1)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: typing-extensions>=4.6.0 in ./.venv/lib/python3.13/site-packages (from sqlalchemy) (4.14.0)
Requirement already satisfied: scipy>=1.6.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (1.15.3)
Requirement already satisfied: joblib>=1.2.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (1.5.1)
Requirement already satisfied: threadpoolctl>=3.1.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (3.6.0)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

`1 -- `
- Create a free SQL Database
- Create a table named employees with the following columns:
    - employee_id (integer, primary key)
    - name (string)
    - position (string, IT-related job titles)
    - start_date (date, between 2015 and 2024)
    - salary (integer, $60,000â€“$200,000)`

I have set up a Postgres database and also I have created the SQL table using the below SQL query

```SQL
CREATE TABLE employees (
  employee_id SERIAL PRIMARY KEY,
  name VARCHAR(50),
  position VARCHAR(50),
  start_date DATE,
  salary INTEGER
);

**Adding the imports**

In [136]:
import random
from faker import Faker
from datetime import date
import pandas as pd
# import psycopg2
from sqlalchemy import create_engine
from sklearn.preprocessing import MinMaxScaler

`2 --`
- Generate & Populate Data
    - Generate at least 50 synthetic records using Python and the Faker library.
    - Insert the data into your cloud database.

In [137]:
# Initializes faker object from the Faker library
fake = Faker()
# Position list that can be assigned randomly to employees
positions = ['Software Engineer', 'Data Analyst', 'DevOps Engineer', 'ML Engineer', 'QA Engineer','Backend Developer', 'Frontend Developer', 'Cloud Architect', 'SysAdmin', 'Data Scientist']
# Running a loop for 100 iterations
for i in range(50):
    # Replace single quote with double quotes
    name = fake.name().replace("'", "''")
    # Select random position for the employee
    position = random.choice(positions)
    # Select any date in the year between 2015 and 2024
    start_date = fake.date_between(start_date=date(2015,1,1), end_date=date(2024,6,1))
    # Select an integer between 60000 and 200000
    salary = random.randint(60000, 200000)
    # print 100 SQL insert queries
    print(f"INSERT INTO employees (name, position, start_date, salary) VALUES('{name}', '{position}', '{start_date}', {salary});")

INSERT INTO employees (name, position, start_date, salary) VALUES('Daniel Baker', 'SysAdmin', '2023-12-10', 184039);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kristina Cox', 'Backend Developer', '2022-02-07', 154559);
INSERT INTO employees (name, position, start_date, salary) VALUES('Molly Chapman', 'Software Engineer', '2020-04-16', 158221);
INSERT INTO employees (name, position, start_date, salary) VALUES('Claudia Andersen', 'Frontend Developer', '2023-10-18', 128728);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mr. Steven Burton', 'SysAdmin', '2018-05-07', 101813);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Khan', 'Data Analyst', '2017-09-14', 160148);
INSERT INTO employees (name, position, start_date, salary) VALUES('Marcus Dixon', 'SysAdmin', '2018-04-27', 161164);
INSERT INTO employees (name, position, start_date, salary) VALUES('Phillip Brown', 'SysAdmin', '2021-12-11', 115553);
INSERT INTO employees (name, position, start_date, salary) VALUES('Rebecca Kerr', 'Frontend Developer', '2017-11-12', 194065);
INSERT INTO employees (name, position, start_date, salary) VALUES('Bryan Oliver', 'Backend Developer', '2023-05-13', 144209);
INSERT INTO employees (name, position, start_date, salary) VALUES('Scott Hebert', 'Frontend Developer', '2021-10-24', 77077);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joshua Stuart', 'Data Analyst', '2018-11-23', 174760);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lance Moore', 'ML Engineer', '2020-07-15', 185653);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Gomez', 'DevOps Engineer', '2018-11-05', 155353);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jonathan Cole PhD', 'Frontend Developer', '2023-09-27', 123556);
INSERT INTO employees (name, position, start_date, salary) VALUES('Krystal Mcdonald', 'Backend Developer', '2019-05-10', 125838);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jamie Johnson', 'Frontend Developer', '2019-01-21', 107810);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stephanie Murphy', 'ML Engineer', '2018-06-11', 126948);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Smith', 'Data Analyst', '2024-04-11', 118804);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kerri Small', 'Data Scientist', '2017-03-07', 144965);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jared Daniels', 'Data Scientist', '2020-05-21', 196578);
INSERT INTO employees (name, position, start_date, salary) VALUES('Robert Landry', 'QA Engineer', '2018-02-19', 97111);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jason Brown', 'Backend Developer', '2019-07-02', 81818);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sarah Smith', 'Backend Developer', '2022-10-14', 131351);
INSERT INTO employees (name, position, start_date, salary) VALUES('Anthony Carney', 'QA Engineer', '2015-08-11', 193276);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jeffrey Holland', 'DevOps Engineer', '2015-08-19', 193285);
INSERT INTO employees (name, position, start_date, salary) VALUES('Deborah Reid', 'ML Engineer', '2017-07-26', 83360);
INSERT INTO employees (name, position, start_date, salary) VALUES('Timothy Lawson', 'ML Engineer', '2022-03-27', 86703);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alan Griffith', 'Cloud Architect', '2022-09-21', 144483);
INSERT INTO employees (name, position, start_date, salary) VALUES('Destiny Hicks', 'Software Engineer', '2021-03-05', 79920);
INSERT INTO employees (name, position, start_date, salary) VALUES('Angela Holt', 'Cloud Architect', '2015-07-10', 92725);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kevin Hester', 'QA Engineer', '2018-04-28', 100985);
INSERT INTO employees (name, position, start_date, salary) VALUES('William Green', 'ML Engineer', '2017-04-06', 80035);
INSERT INTO employees (name, position, start_date, salary) VALUES('Luis Kirby II', 'SysAdmin', '2023-01-11', 143577);
INSERT INTO employees (name, position, start_date, salary) VALUES('Courtney Nicholson', 'ML Engineer', '2022-01-21', 69240);
INSERT INTO employees (name, position, start_date, salary) VALUES('Walter Sanford', 'Data Analyst', '2017-02-06', 86466);
INSERT INTO employees (name, position, start_date, salary) VALUES('Willie Williams', 'QA Engineer', '2018-05-16', 171057);
INSERT INTO employees (name, position, start_date, salary) VALUES('Gloria Johnson', 'Backend Developer', '2015-06-04', 65498);
INSERT INTO employees (name, position, start_date, salary) VALUES('David Reyes', 'Data Analyst', '2021-12-06', 104771);
INSERT INTO employees (name, position, start_date, salary) VALUES('Andrew Murphy', 'Cloud Architect', '2017-10-05', 168734);
INSERT INTO employees (name, position, start_date, salary) VALUES('Holly Webb MD', 'Data Analyst', '2019-05-01', 100446);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sydney Delacruz', 'Data Analyst', '2018-11-15', 169657);
INSERT INTO employees (name, position, start_date, salary) VALUES('Benjamin Jordan', 'DevOps Engineer', '2017-02-19', 169641);
INSERT INTO employees (name, position, start_date, salary) VALUES('Gail Clark', 'QA Engineer', '2019-11-16', 106104);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dennis Boyer', 'Frontend Developer', '2020-12-17', 137526);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jenna Cline', 'QA Engineer', '2015-04-06', 178050);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brooke Rivera', 'Data Analyst', '2018-04-07', 69612);
INSERT INTO employees (name, position, start_date, salary) VALUES('Keith Davidson', 'Backend Developer', '2019-07-23', 90890);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Kelley', 'Backend Developer', '2021-01-05', 115934);
INSERT INTO employees (name, position, start_date, salary) VALUES('William Gardner', 'Data Scientist', '2023-10-03', 96780);

`3--`
- Connect and Load Data
- Using Python, psycopg2, and Pandas, connect to your cloud database.
- Query the entire employee table and load the data into a Pandas DataFrame.
- Display the first few rows using df.head().

In [138]:
# Connection string
conn_str = "postgresql://neondb_owner:npg_Ppd3S2nUcWfx@ep-steep-rain-a8s0cnp2-pooler.eastus2.azure.neon.tech/neondb?sslmode=require"
# Create SQLAlchemy engine
engine = create_engine(conn_str)
# Query entire employee table and load the data into the dataframe
df = pd.read_sql_query("SELECT * FROM employees;", engine)
# Display the first few records , showing the first 50 records
print(df.head(50))
# Close the engine
engine.dispose()

    employee_id               name            position  start_date  salary
0             1       Kevin Oneill     Cloud Architect  2017-11-30  161668
1             2     Kimberly Payne  Frontend Developer  2017-01-23   95859
2             3     William Barnes        Data Analyst  2017-12-19   92061
3             4          Lori Reed        Data Analyst  2023-07-01  167598
4             5      Benjamin Pham   Backend Developer  2021-06-11  182198
5             6    Jessica Cochran     Cloud Architect  2021-09-12   81522
6             7        Amanda Rose            SysAdmin  2018-08-25  151145
7             8   Michael Campbell      Data Scientist  2019-05-06  165898
8             9  Stephanie Pacheco         ML Engineer  2017-03-23  112218
9            10       Amanda Evans         ML Engineer  2022-11-11  166350
10           11        Martin Hunt         ML Engineer  2022-08-12  174615
11           12      Casey Simmons  Frontend Developer  2020-01-27  123668
12           13    Melanie Wheeler        Data Analyst  2015-12-13  156600
13           14       Scott Acosta   Backend Developer  2019-12-16   91228
14           15        Mary Rivera        Data Analyst  2022-01-30  142541
15           16        Lisa Nguyen         QA Engineer  2019-05-20   64433
16           17      Jorge Holland   Software Engineer  2019-05-10  128078
17           18     Patricia Clark     Cloud Architect  2020-06-07  112477
18           19       Amanda Burns      Data Scientist  2020-08-27   89156
19           20      Kelsey Fields     Cloud Architect  2017-05-06  106926
20           21      Andrea Watson  Frontend Developer  2015-04-19  197577
21           22         Adam Reyes        Data Analyst  2018-01-30  104550
22           23      Tyler Beasley  Frontend Developer  2022-07-09  165110
23           24      Rebecca Evans        Data Analyst  2017-04-29  115393
24           25       Hailey Green     Cloud Architect  2020-01-13  176671
25           26      Leah Gonzalez        Data Analyst  2018-05-31   64478
26           27     Thomas Chapman      Data Scientist  2023-07-10  170089
27           28       David Baxter   Software Engineer  2018-04-08  134762
28           29       Roger Rhodes      Data Scientist  2024-01-03   78220
29           30      Edwin Collins            SysAdmin  2023-03-13   93485
30           31   Michelle Johnson   Backend Developer  2023-07-13  141817
31           32    Alexander Cooke         ML Engineer  2020-01-05   94235
32           33  William Rodriguez      Data Scientist  2017-11-26  155238
33           34      Robert Wright      Data Scientist  2019-03-10  127010
34           35       Kyle Alvarez     DevOps Engineer  2016-10-17  192327
35           36       Pedro Archer     Cloud Architect  2019-11-13  191887
36           37     Bryce Ferguson         ML Engineer  2020-05-26  181936
37           38         Mary Lewis     DevOps Engineer  2023-03-03  131314
38           39         Todd Burns     DevOps Engineer  2023-01-14  190198
39           40       Jeffrey Hill            SysAdmin  2021-02-27  111234
40           41   Michael Caldwell     DevOps Engineer  2018-10-19  183501
41           42      Joseph George            SysAdmin  2023-02-26  135918
42           43   Raymond Hamilton     DevOps Engineer  2023-10-31   63701
43           44      Amber Sweeney            SysAdmin  2017-11-30  191751
44           45   Alejandra Nelson   Software Engineer  2015-08-22  120681
45           46     Lisa Carpenter   Software Engineer  2020-03-08   69215
46           47    Jessica Wallace         ML Engineer  2020-04-05  191279
47           48       Tina Gardner        Data Analyst  2022-02-20  136623
48           49   Alexander Clarke            SysAdmin  2015-04-16   75800
49           50          Jody Ward            SysAdmin  2015-08-09   78806

`4--`
**Explain each EDA step**

#### **Data Collection**

**`Database Setup and data collection`**
- Go to https://neon.tech/
- Sign up with your GitHub or Google account
- After logging in, click `Create a project`
- Set the project name.
- Choose any region and click `CreateProject`
- Once in the project dashboard page, click on the `connect` button on top right side.
- Copy the connection string
- Select the SQLEditor option , and then copy the SQL query below to create the employees table
- ```SQL
    CREATE TABLE employees (
    employee_id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    position VARCHAR(50),
    start_date DATE,
    salary INTEGER
    );
- Generate 100 asynthetic records using Python and the Faker library. We generate 100 INSERT queries and copy the insert queries.
- Go to project dashboard page and then selected `SQLEditor` and then executed the 100 INSERT queries to insert the data into the cloud database.

#### **Data Cleaning**
- I checked for the missing values and I could find that there were no null or empty values present. This was checked using the command `df.info()`
- Also the data types for each columns names were correct as per the requirement using the command `df.info()`

In [139]:
# Column types and null counts
df.info()

# Check for the missing values
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  50 non-null     int64
 1   name         50 non-null     object
 2   position     50 non-null     object
 3   start_date   50 non-null     object
 4   salary       50 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.1+ KB

employee_id    0
name           0
position       0
start_date     0
salary         0
dtype: int64

#### **Data Transformation**
- As part of data transformation , I have created a new column `years_of_service` by calculating the difference between the current date and the sart_date

In [140]:
df['years_of_service'] = date.today().year - pd.DatetimeIndex(df['start_date']).year
df.head()

,employee_id,name,position,start_date,salary,years_of_service
0,1,Kevin Oneill,Cloud Architect,2017-11-30,161668,8
1,2,Kimberly Payne,Frontend Developer,2017-01-23,95859,8
2,3,William Barnes,Data Analyst,2017-12-19,92061,8
3,4,Lori Reed,Data Analyst,2023-07-01,167598,2
4,5,Benjamin Pham,Backend Developer,2021-06-11,182198,4

#### **Feature Engineering**
- As a part of the feature engineering, I have added a new column
**Seniority Level** -
  - "Junior" if they have worked less than 3 years
  - "Mid-Level" if they have worked between 3 and 6 years
  - "Senior" if they have worked more than 6 years

  `To implement the Seniority Level, I used the lamda function`.

In [141]:
# Create a seniority level based on years of service
df['seniority'] = df['years_of_service'].apply(
    lambda x: 'Junior' if x < 3 else 'Mid-Level' if x < 7 else 'Senior'
)

# Show new features
df[['employee_id', 'name', 'position', 'years_of_service', 'seniority']].head()

,employee_id,name,position,years_of_service,seniority
0,1,Kevin Oneill,Cloud Architect,8,Senior
1,2,Kimberly Payne,Frontend Developer,8,Senior
2,3,William Barnes,Data Analyst,8,Senior
3,4,Lori Reed,Data Analyst,2,Junior
4,5,Benjamin Pham,Backend Developer,4,Mid-Level

#### **Scaling**
- As a part of the feature scaling, I have added a `new column` called **Normalized Salary**. Salary are usually in large numbers like $80,000 or $150,000, which can be hard to compare so I used a method called *Min-Max Scaling* to convert all salaries to a range between **0 and 1** and this makes it easier to make visualizations.

In [142]:
# Normalize the salary column using Min-Max Scaling
minmax = MinMaxScaler()
df['normalized_salary'] = minmax.fit_transform(df[['salary']])

df[['employee_id', 'name', 'position', 'normalized_salary', 'years_of_service', 'seniority']].head()

,employee_id,name,position,normalized_salary,years_of_service,seniority
0,1,Kevin Oneill,Cloud Architect,0.731774,8,Senior
1,2,Kimberly Payne,Frontend Developer,0.240207,8,Senior
2,3,William Barnes,Data Analyst,0.211838,8,Senior
3,4,Lori Reed,Data Analyst,0.776069,2,Junior
4,5,Benjamin Pham,Backend Developer,0.885125,4,Mid-Level

`5--`
- Show Descriptive Statistics

I have used the following commands here. They are:
- `.info()` -  shows the column data types and the count of non-null values.
- `.describe()` gives summary statistics like mean, min, max, standard deviation, count and quartiles.
- `.isnull().sum()` shows if any values are missing

In [143]:
# shows the column data types and the frequency of non-null values.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   employee_id        50 non-null     int64
 1   name               50 non-null     object
 2   position           50 non-null     object
 3   start_date         50 non-null     object
 4   salary             50 non-null     int64
 5   years_of_service   50 non-null     int32
 6   seniority          50 non-null     object
 7   normalized_salary  50 non-null     float64
dtypes: float64(1), int32(1), int64(2), object(4)
memory usage: 3.1+ KB

In [144]:
# shows the count of missing values
df.isnull().sum()

employee_id          0
name                 0
position             0
start_date           0
salary               0
years_of_service     0
seniority            0
normalized_salary    0
dtype: int64

In [145]:
# Shows the summary statistics like count, mean, standard deviation, min, max and the quartiles.
df.describe()

       employee_id         salary  years_of_service  normalized_salary
count     50.00000      50.000000          50.00000          50.000000
mean      25.50000  132620.900000           5.56000           0.514804
std       14.57738   41357.282551           2.61206           0.308922
min        1.00000   63701.000000           1.00000           0.000000
25%       13.25000   94641.000000           3.00000           0.231109
50%       25.50000  133038.000000           5.50000           0.517920
75%       37.75000  167286.000000           8.00000           0.773738
max       50.00000  197577.000000          10.00000           1.000000